tutorials/rigidBodyAndBeam_loop_nOuter8/constant/beam/timeVsMoment
(
    ( 0 (0 0 0) )
    ( 3 (0 0 0) )
)
