tutorials/rigidBodyAndBeam_loop_nOuter8/0/beam/Qa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "2";
    object      Qa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
59
(
19.4988
19.4988
19.4988
19.4988
19.4988
19.4988
19.4988
19.4988
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform -19.4988;
    }
    right
    {
        type            calculated;
        value           uniform 19.4988;
    }
    beam
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
